# https://github.com/torifat/dotfiles/blob/master/Brewfile

cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/dupes'
tap 'Caskroom/versions'

brew 'curl', args: ['with-openssl', 'with-nghttp2']

# Install GNU core utilities (those that come with macOS are outdated).
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']
brew 'wget', args: ['with-iri']
brew 'tmux'
brew 'n'

# Install more recent versions of some macOS tools.
brew 'vim', args: ['with-override-system-vi']
brew 'grep', args: ['with-default-names']
brew 'less', args: ['with-pcre']
brew 'openssh'

# Other useful stuff
brew 'ngrep'
brew 'ctags' # For vim Tagbar

# Install other useful binaries.
brew 'ack'
brew 'git'
brew 'stow'
brew 'tree'
brew 'dark-mode'
brew 'jq'
brew 'hub'
brew 'watchman'
brew 'wifi-password'
brew 'axel'
brew 'fortune'
brew 'mtr'
brew 'ssh-copy-id'

# GUI Apps
cask 'iterm2'
cask 'google-chrome'
cask 'sublime-text'
cask '1password'
cask 'dropbox'
cask 'sketch'
cask 'vlc'
cask 'ngrok'
cask 'java'
cask 'qlmarkdown'
cask 'kap'
#cask 'little-snitch'
#cask 'paw'
#cask 'ksdiff'

# Non-essential Apps
cask 'airserver'
cask 'licecap'
cask 'numi'
cask 'knuff'
#cask 'codekit'
#cask 'dripcap'


# AppStore
mas 'Tweetbot', id: 557168941
mas 'Sip', id: 507257563
mas 'Amphetamine', id: 937984704
#mas 'Kaleidoscope', id: 587512244
#mas 'DaisyDisk', id: 411643860

# Window Management [Choose One]
mas 'Magnet', id: 441258766
# mas 'Divvy', id: 413857545
# mas 'BetterSnapTool', id: 417375580
# cask 'spectacle' # Free alternative
# cask 'amethyst' # Free alternative

